In [94]:
%matplotlib inline
import matplotlib.pyplot as plt
import seaborn as sns
import numpy as np
import pandas as pd  # asi se suele importar Pandas
plt.style.use('seaborn-darkgrid')

Esta notebook es una traducción y adaptación de [notebooks](https://github.com/fonnesbeck/Bios8366/tree/master/notebooks) creadas por Chris Fonnesbeck y de notebooks del libro [Python Data Science Handbook](https://github.com/jakevdp/PythonDataScienceHandbook) de Jake Vanderplas.

# Manipulación de datos y Pandas

**Pandas** es un paquete que Python que provee estructuras de datos rápidas, flexibles y expresivas diseñadas para trabajar con datos _rotulados_. Dichas estructuras de datos se pueden pensar como _arrays_ de NumPy donde las filas y colummnas están rótuladas. O de forma similar como una _planilla de cálculo_ bajo Python.

Asi como NumPy es una muy buena herramienta para trabajar con números, vectores, algebra lineal, etc. Pandas es adecuado para trabajar con:

* Datos tabulares y heterogeneos (flotantes, string, enteros, etc)
* Series temporales
* Los mismos datos que se pueden manipular con _arreglos_ de NumPy!


¿Por qué es importante tener una herramienta como Pandas?


<img src="imagenes/analisis.png"  width=400>

El tiempo consumido (por un humano) en aplicar métodos estadísticos y/o de _machine learning_ es en muchos casos mucho menor la tiempo requerido para obtener y procesar los datos. Pandas intenta facilitar el procesado de los datos con el objetivo que pasemos más tiempo pensando en los problemas que queremos resolver. Procesar datos es una tarea que suele involucrar los siguientes pasos

1. Leer los datos: Los datos pueden estar contenidos en diversos formatos, CSV, HTML, xls, pdf, texto plano, imágenes, hojas de papel! etc
2. Procesar datos: Los datos rara vez están listos para usar, pueden faltar datos, haber dudas sobre los valores registrados, inconsistencias, etc. Además puede ser necesario generar _datos derivados_ a partir de los datos disponibles, por ej podríamos necesitar la densidad poblacional pero solo tenemos la población y la superficie.
3. Almacenar datos: Ya sea para pasarselos a otra pieza de software para por ej visualizar o hacer un análisis estadístico de los datos, o ya sea para su posterior uso por nosotros o terceros.

## Pandas

Pandas introduce fundamentalmente 3 nuevas estructuras de datos:
* Las `Series` 
* Los `DataFrame`
* Los `Index`

Empezemos por la primera de estas.

### Series

Una _Series_ de Pandas es un conjunto unidimensional de datos (similar a un _array_) acompañados de un índice que "rotula" a cada elemento del vector. Puede ser creada a partir de un array o tupla o lista.

In [95]:
conteo = pd.Series([632, 1638, 569, 115])
conteo

0     632
1    1638
2     569
3     115
dtype: int64

La primer columna contiene los índices y la segunda nuestros datos. Como omitimos indicar un índice Pandas asignó automáticamente una secuencia de enteros (empezando por 0). 

A partir de una serie es posible obtener solo el _array_ de NumPy "contenido" en ella.

In [96]:
conteo.values

array([ 632, 1638,  569,  115])

Como también es posible obtener solo el índice.

In [97]:
conteo.index

RangeIndex(start=0, stop=4, step=1)

Es importante notar que los arreglos de NumPy también tienen índices, solo que estos están implícitios y siempre son enteros comenzando desde el 0. En cambio los índices en Pandas son explícitos. Podemos asignar rotulos que tengan sentido según nuestros datos. Si nuestros datos representan la cantidad de bacterias según sus especies, podríamos tener algo como:

In [98]:
bacteria = pd.Series([632, 1638, 569, 115],
                     index=['Firmicutes', 'Proteobacteria',
                            'Actinobacteria', 'Bacteroidetes'])

bacteria

Firmicutes         632
Proteobacteria    1638
Actinobacteria     569
Bacteroidetes      115
dtype: int64

Ahora que tenemos rótulos por un lado y datos por el otro podríamos decir que una serie se puede pensar también como un tipo de diccionario! Si esta analogía es válida deberíamos poder usar los rótulos para referirnos directamente a los valores contenidos en la serie.

In [99]:
bacteria['Actinobacteria']

569

La siguiente sintaxis también función (_azucar sintáctico_)

In [100]:
bacteria.Actinobacteria

569

A diferencia de los diccionarios es posible hacer `slicing`

In [101]:
bacteria['Proteobacteria':]

Proteobacteria    1638
Actinobacteria     569
Bacteroidetes      115
dtype: int64

Al igual que con los arreglos de NumPy podemos usar booleanos para indexar una serie. Si quisieramos el conteo de  bacterias para todas aquellas cuyos nombres terminan en "bacteria" podríamos hacer:

In [102]:
bacteria[[nombre.endswith('bacteria') for nombre in bacteria.index]]

Proteobacteria    1638
Actinobacteria     569
dtype: int64

También podemos hacer operaciones múy útiles como la siguiente:

In [103]:
bacteria[bacteria > 1000]

Proteobacteria    1638
dtype: int64

También es posible hacer uso del índice _implicito_ (como en listas y arreglos)

In [104]:
bacteria[1]

1638

Es posible operar con los valores de una serie manteniendo los rótulos sin modificar

In [105]:
np.log(bacteria)

Firmicutes        6.448889
Proteobacteria    7.401231
Actinobacteria    6.343880
Bacteroidetes     4.744932
dtype: float64

Como ya dijimos es posible pensar en una `Series` como si fuera una especie de diccionario, incluso podemos crear series a partir de diccionarios!

In [106]:
bacteria_dict = {'Firmicutes': 632,
                 'Proteobacteria': 1638,
                 'Actinobacteria': 569,
                 'Bacteroidetes': 115}

pd.Series(bacteria_dict)

Actinobacteria     569
Bacteroidetes      115
Firmicutes         632
Proteobacteria    1638
dtype: int64

Si observan con atención verán que Pandas ordenó alfabeticamente los indices en la `Series` (junto con sus valores asociados).

Si queremos algún orden en particular podemos especificar los índices. Incluso podemos pasar rotulos para valores que no existen. En ese caso Pandas interpretará que tenemos datos faltantes (_missing data_) y lo indicará usando un tipo especial de _float_ `NaN` (not a number).

In [107]:
bacteria2 = pd.Series(bacteria_dict,
                      index=['Cyanobacteria',
                             'Firmicutes',
                             'Proteobacteria',
                             'Actinobacteria'])
bacteria2

Cyanobacteria        NaN
Firmicutes         632.0
Proteobacteria    1638.0
Actinobacteria     569.0
dtype: float64

Los índices no son solo una conveniencia para manipular datos haciendo referencia a nombres que nos puede resultar más familiares o convenientes (comparado con recordar la posición de los datos). Los índices son usados para **alinear datos** al operar con más de una serie, por ej podríamos queres obtener el total de bacterias en dos conjuntos de datos.

In [108]:
bacteria

Firmicutes         632
Proteobacteria    1638
Actinobacteria     569
Bacteroidetes      115
dtype: int64

In [109]:
bacteria + bacteria2

Actinobacteria    1138.0
Bacteroidetes        NaN
Cyanobacteria        NaN
Firmicutes        1264.0
Proteobacteria    3276.0
dtype: float64

Como verán Pandas sumó solo los valores para  los cuales los índices de ambas `Series` coinciden, propagando además los valores faltantes (`NaN`). 

¿Qué sucede si intentamos sumar dos arreglos de NumPy de distinta longitud?

## DataFrame

Al analizar datos es común que tengamos que trabajar con datos multivariados. Es decir con más de una variable. Para esos casos sería útil tener algo como una `Series` donde para cada índice tengamos más de una columna de valores. Ese objeto se llama `DataFrame`.

Un `DataFrame` es una estructura de datos tabular que se puede pensar como una colección de `Series` (que comparten un mismo índice). También es posible pensar un `DataFrame` como una generalización de un arreglo de NumPy o de una diccionario.

In [110]:
datos = pd.DataFrame({'conteo':[632, 1638, 569, 115, 433, 1130, 754, 555],
                     'paciente':[1, 1, 1, 1, 2, 2, 2, 2],
                     'phylum':['Firmicutes', 'Proteobacteria', 'Actinobacteria', 
    'Bacteroidetes', 'Firmicutes', 'Proteobacteria', 'Actinobacteria', 'Bacteroidetes']})

datos

   conteo  paciente          phylum
0     632         1      Firmicutes
1    1638         1  Proteobacteria
2     569         1  Actinobacteria
3     115         1   Bacteroidetes
4     433         2      Firmicutes
5    1130         2  Proteobacteria
6     754         2  Actinobacteria
7     555         2   Bacteroidetes

Lo primero que notamos es que `Jupyter` le pone un poco de estilo al `DataFrame`, y lo muestra como una tabla con algunas mejoras estéticas.

También podemos ver que contrario a un arreglo de NumPy en un `DataFrame` podemos tener datos de distinto tipo (enteros y _strings_ en este caso). Además se ve que las columnas están ordenadas alfabeticamente, podemos cambiar el orden indexando el `DataFrame` en el orden preferido.

In [111]:
datos[['paciente', 'phylum', 'conteo']]

   paciente          phylum  conteo
0         1      Firmicutes     632
1         1  Proteobacteria    1638
2         1  Actinobacteria     569
3         1   Bacteroidetes     115
4         2      Firmicutes     433
5         2  Proteobacteria    1130
6         2  Actinobacteria     754
7         2   Bacteroidetes     555

Los `DataFrame` tienen dos `index`, el mismo que ya vimos para las series que se corresponden con las filas y uno nuevo que se corresponde con las columnas

In [112]:
datos.columns

Index(['conteo', 'paciente', 'phylum'], dtype='object')

Es posible acceder a los valores de las columnas como con un diccionario

In [113]:
datos['conteo']

0     632
1    1638
2     569
3     115
4     433
5    1130
6     754
7     555
Name: conteo, dtype: int64

o por atributo (un atributo es el nombre que se le da a un dato o propiedad en programación orientada a objetos)

In [114]:
datos.conteo

0     632
1    1638
2     569
3     115
4     433
5    1130
6     754
7     555
Name: conteo, dtype: int64

Una posible fuente  de confusión es que la sintaxis que acabamos de ver devuelve filas en una `Series`, pero columnas en un `DataFrame`. Si queremos acceder a las filas de un `DataFrame` podemos hacerlo usando el atributo `loc`:

In [115]:
datos.loc[3]

conteo                115
paciente                1
phylum      Bacteroidetes
Name: 3, dtype: object

¿Que pasa si intentamos acceder a una fila usando la sintaxis `datos[3]`?

La serie que se obtienen al indexar un `DataFrame` es una _vista_ (_view_) del `DataFrame` y NO una copia. Por lo que hay que tener cuidado al manipularla, por ello Pandas nos devuelve una advertencia.

In [116]:
cont = datos.conteo
cont

0     632
1    1638
2     569
3     115
4     433
5    1130
6     754
7     555
Name: conteo, dtype: int64

In [117]:
cont[5] = 0
cont

/home/osvaldo/anaconda3/lib/python3.6/site-packages/ipykernel_launcher.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/indexing.html#indexing-view-versus-copy
  """Entry point for launching an IPython kernel.

0     632
1    1638
2     569
3     115
4     433
5       0
6     754
7     555
Name: conteo, dtype: int64

In [118]:
datos

   conteo  paciente          phylum
0     632         1      Firmicutes
1    1638         1  Proteobacteria
2     569         1  Actinobacteria
3     115         1   Bacteroidetes
4     433         2      Firmicutes
5       0         2  Proteobacteria
6     754         2  Actinobacteria
7     555         2   Bacteroidetes

Si queremos moficiar una `Series` que proviene de un `DataFrame` puede ser buena idea hacer una copia primero.

In [119]:
cont = datos.conteo.copy()
cont[5] = 1000
datos

   conteo  paciente          phylum
0     632         1      Firmicutes
1    1638         1  Proteobacteria
2     569         1  Actinobacteria
3     115         1   Bacteroidetes
4     433         2      Firmicutes
5       0         2  Proteobacteria
6     754         2  Actinobacteria
7     555         2   Bacteroidetes

Es posible crear columnas usando asignaciones

In [120]:
datos['año'] = 2013
datos

   conteo  paciente          phylum   año
0     632         1      Firmicutes  2013
1    1638         1  Proteobacteria  2013
2     569         1  Actinobacteria  2013
3     115         1   Bacteroidetes  2013
4     433         2      Firmicutes  2013
5       0         2  Proteobacteria  2013
6     754         2  Actinobacteria  2013
7     555         2   Bacteroidetes  2013

Aunque si usamos la sintaxis de  atributo el resultado es distinto

In [121]:
datos.tratamiento = 1
datos.tratamiento

1

Este cambio no se ve reflejado en el `DataFrame`

In [122]:
datos

   conteo  paciente          phylum   año
0     632         1      Firmicutes  2013
1    1638         1  Proteobacteria  2013
2     569         1  Actinobacteria  2013
3     115         1   Bacteroidetes  2013
4     433         2      Firmicutes  2013
5       0         2  Proteobacteria  2013
6     754         2  Actinobacteria  2013
7     555         2   Bacteroidetes  2013

Podemos agregar una `Series` como una nueva columna en un `DataFrame`, el resultado dependerá de los índices de ambos objetos.

In [123]:
tratamiento = pd.Series([0]*4 + [1]*2)
tratamiento

0    0
1    0
2    0
3    0
4    1
5    1
dtype: int64

In [124]:
datos['tratamiento'] = tratamiento
datos

   conteo  paciente          phylum   año  tratamiento
0     632         1      Firmicutes  2013          0.0
1    1638         1  Proteobacteria  2013          0.0
2     569         1  Actinobacteria  2013          0.0
3     115         1   Bacteroidetes  2013          0.0
4     433         2      Firmicutes  2013          1.0
5       0         2  Proteobacteria  2013          1.0
6     754         2  Actinobacteria  2013          NaN
7     555         2   Bacteroidetes  2013          NaN

¿Qué pasa si en la celda siguiente intentamos agregar una nueva cuya longitud no coincida con la del `DataFrame`?

In [125]:
datos['mes'] = ['enero'] * len(datos)
datos

   conteo  paciente          phylum   año  tratamiento    mes
0     632         1      Firmicutes  2013          0.0  enero
1    1638         1  Proteobacteria  2013          0.0  enero
2     569         1  Actinobacteria  2013          0.0  enero
3     115         1   Bacteroidetes  2013          0.0  enero
4     433         2      Firmicutes  2013          1.0  enero
5       0         2  Proteobacteria  2013          1.0  enero
6     754         2  Actinobacteria  2013          NaN  enero
7     555         2   Bacteroidetes  2013          NaN  enero

Podemos usar `del` para eliminar columnas de la misma forma que en diccionarios.

In [126]:
del datos['mes']
datos

   conteo  paciente          phylum   año  tratamiento
0     632         1      Firmicutes  2013          0.0
1    1638         1  Proteobacteria  2013          0.0
2     569         1  Actinobacteria  2013          0.0
3     115         1   Bacteroidetes  2013          0.0
4     433         2      Firmicutes  2013          1.0
5       0         2  Proteobacteria  2013          1.0
6     754         2  Actinobacteria  2013          NaN
7     555         2   Bacteroidetes  2013          NaN

Es posible _extaer_ los datos de un `DataFrame` en forma de arreglo de NumPy.

In [127]:
datos.values

array([[632, 1, 'Firmicutes', 2013, 0.0],
       [1638, 1, 'Proteobacteria', 2013, 0.0],
       [569, 1, 'Actinobacteria', 2013, 0.0],
       [115, 1, 'Bacteroidetes', 2013, 0.0],
       [433, 2, 'Firmicutes', 2013, 1.0],
       [0, 2, 'Proteobacteria', 2013, 1.0],
       [754, 2, 'Actinobacteria', 2013, nan],
       [555, 2, 'Bacteroidetes', 2013, nan]], dtype=object)

Fijense que el `dtype` del arreglo es `object`. Esto se debe a la mezcla de enteros _strings_ y flotantes (`Nan`). El `dtype` es elegido por Pandas automaticamente de forma tal de acomodar todos los tipos de valores presentes en el `DataFrame`. 

¿Qué hubiramos obtenido si la columna `phylum` no fuese parte del dataFrame?

## Index

La última estructura de datos que nos queda ver es `Index`, la cual en realidad la venimos usando desde el principio de este capítulo. Solo que ahora hablaremos de ella de forma un poco más explícita.

In [128]:
datos.index

RangeIndex(start=0, stop=8, step=1)

Los `Index` son inmutables, lo cual pueden comprobar al descomentar y ejecutar la siguiente celda.

In [129]:
#datos.index[0] = 15

Esto está pensado para permitir que los `Index` se compartan entre objetos sin riesgo de que se modifiquen en algún momento.

## Importando datos

En principio es posible usar Python para leer cualquier archivo que uno desee, pero para el trabajo rutinario de un científico de datos es preferible tener a mano funciones ya _enlatadas_. NumPy provee de algunas funciones para leer archivos, como `genfromtxt` y `loadtxt`, que funcionan bastante bien para archivos relativamente simples. Pandas ofrece funciones  más vestátiles  y robustas para cuando nos encontramos con archivos _no tan simples_.

Empecemos leyendo un archivo en formato csv (comma separated values)

In [130]:
!head datos/microbioma.csv  # este es un comando de linux que nos permite ver las primeras lineas de un archivo

Taxon,Paciente,Grupo,Tejido,Heces
Firmicutes,1,0,136,4182
Firmicutes,2,1,1174,703
Firmicutes,3,0,408,3946
Firmicutes,4,1,831,8605
Firmicutes,5,0,693,50
Firmicutes,6,1,718,717
Firmicutes,7,0,173,33
Firmicutes,8,1,228,80
Firmicutes,9,0,162,3196

Pandas ofrece una función llamada `read_csv` ideal para leer este tipo de datos:

In [131]:
mb = pd.read_csv('datos/microbioma.csv')

In [132]:
type(mb)

pandas.core.frame.DataFrame

De forma similar al comando `head` de Linux, le pedimos podemos pedir a Pandas que nos nuestre solo las primeras lineas.

In [133]:
mb.head()

        Taxon  Paciente  Grupo  Tejido  Heces
0  Firmicutes         1      0     136   4182
1  Firmicutes         2      1    1174    703
2  Firmicutes         3      0     408   3946
3  Firmicutes         4      1     831   8605
4  Firmicutes         5      0     693     50

Por defecto `read_csv` usará la primer linea del archivo como encabezado (_header_). Este comportamiento lo podemos modificar usando el argumento `header`.

In [134]:
pd.read_csv('datos/microbioma.csv', header=None).head()

            0         1      2       3      4
0       Taxon  Paciente  Grupo  Tejido  Heces
1  Firmicutes         1      0     136   4182
2  Firmicutes         2      1    1174    703
3  Firmicutes         3      0     408   3946
4  Firmicutes         4      1     831   8605

Por defecto `read_csv` usa `,` como separadores, pero es posible modificar este comportamiento usando el argumento `sep`. Un caso muy común es el de archivos que tienen una cantidad variable de espacios en blanco. En esos casos podemos usar una [expresión regular](https://docs.python.org/3.6/library/re.html):
 
    sep='\s+'

`'\s+'` quiere decir "1 o más espacios en blanco". Otro caso común son archivos separados por tabulaciones (tabs), en ese caso podemos usar `\t`.

Si queremos omitir datos (por ejemplo datos mal tomados), podemos indicaselo a Pandas usando el argumento `skiprows`:

In [135]:
pd.read_csv('datos/microbioma.csv', skiprows=[3,4,6]).head()

        Taxon  Paciente  Grupo  Tejido  Heces
0  Firmicutes         1      0     136   4182
1  Firmicutes         2      1    1174    703
2  Firmicutes         5      0     693     50
3  Firmicutes         7      0     173     33
4  Firmicutes         8      1     228     80

También podemos indicarque que solo queremos importar unas pocas columnas, lo que puede ser muy útil cuando estamos haciendo pruebas y explorando los datos y queremos evitar importar un larga lista de datos.

In [136]:
pd.read_csv('datos/microbioma.csv', nrows=4)

        Taxon  Paciente  Grupo  Tejido  Heces
0  Firmicutes         1      0     136   4182
1  Firmicutes         2      1    1174    703
2  Firmicutes         3      0     408   3946
3  Firmicutes         4      1     831   8605

Pandas ofrece la capacidad de leer varios otros formatos incluyendo archivos `xls`, `xlsx`, `JSON`, `XML`, `HDF5`, etc. Para más información leer la documentación de Pandas o [Python for Data Analysis](http://shop.oreilly.com/product/0636920023784.do).

### Datos faltantes

Es común al analizar datos encontrarnos con datos faltantes. Las razones son variadas desde errores de transcripción, errores en la toma de muestra, observaciones incompletas, etc. En algunos casos estos datos faltantes quedan registrados simplemente como _huecos_ en los datos o usando algunos _valores sentinelas_ especiales como `NaN`, `None` o valores que esten _claramente_ fuera del rango de los datos como podrían ser `-9999` para valores de datos positivos o `999` para valores que, digamos, son inferiores a 100.

In [137]:
!head datos/microbioma_faltantes.csv

Taxon,Paciente,Tejido,Heces
Firmicutes,1,632,305
Firmicutes,2,136,4182
Firmicutes,3,,703
Firmicutes,4,408,3946
Firmicutes,5,831,8605
Firmicutes,6,693,50
Firmicutes,7,718,717
Firmicutes,8,173,33
Firmicutes,9,228,NA

In [138]:
mbm = pd.read_csv('datos/microbioma_faltantes.csv')
mbm.head(14)

         Taxon  Paciente Tejido    Heces
0   Firmicutes         1    632    305.0
1   Firmicutes         2    136   4182.0
2   Firmicutes         3    NaN    703.0
3   Firmicutes         4    408   3946.0
4   Firmicutes         5    831   8605.0
5   Firmicutes         6    693     50.0
6   Firmicutes         7    718    717.0
7   Firmicutes         8    173     33.0
8   Firmicutes         9    228      NaN
9   Firmicutes        10    162   3196.0
10  Firmicutes        11    372 -99999.0
11  Firmicutes        12   4255   4361.0
12  Firmicutes        13    107   1667.0
13  Firmicutes        14      ?    223.0

En el ejemplo anterior Pandas reconoció correctamente a `NA` y a un campo vacío como datos faltantes, pero pasó por alto a `?` y a `-99999`. Es facil pasar por alto estos errores, por lo que siempre es buena idea hacer gráficos de los datos y resúmenes como el siguiente:

In [139]:
mbm.describe()

        Paciente         Heces
count  75.000000     74.000000
mean    8.000000   -619.283784
std     4.349588  11801.273013
min     1.000000 -99999.000000
25%     4.000000     12.500000
50%     8.000000     79.500000
75%    12.000000    658.500000
max    15.000000   8605.000000

Se puede ver que el conteo para `Paciente` y `Heces` no coinciden, que el valor más pequeño para `Heces` es un número negativo cuando debería ser mayor o igual a cero. Y vemos que no tenémos descripción para `Tejido`! ¿Se te ocurre por que falta la columna para `Tejido`?

Para especificar valores addicionales que considerar como datos faltantes usamos `na_values`.

In [140]:
mbm = pd.read_csv('datos/microbioma_faltantes.csv', na_values=['?', -99999])

In [141]:
mbm.describe()

        Paciente        Tejido        Heces
count  75.000000     73.000000    73.000000
mean    8.000000    984.315068   742.082192
std     4.349588   1840.338155  1467.675342
min     1.000000      0.000000     0.000000
25%     4.000000    109.000000    14.000000
50%     8.000000    310.000000    83.000000
75%    12.000000    831.000000   661.000000
max    15.000000  12044.000000  8605.000000

Si fuese necesario especificar valores distintos para distintas columnas es posible pasar un diccionario a `na_values`, indicando los nombres de las columnas y los valores a usar como indicadores. Este es un buen momento para que pruebes como hacer esto antes de seguir con la nueva sección.

#### Operaciones con data faltantes

Pandas ofrece métodos que nos permiten detectar, remover  y reemplazar datos faltantes. Podemos preguntar a Pandas cuales son los valores _null_.

In [142]:
mbm.isnull()[:3]  # y su opuesto .notnull()

   Taxon  Paciente  Tejido  Heces
0  False     False   False  False
1  False     False   False  False
2  False     False    True  False

O podríamos queres eliminar los valores _nulos_. Esto es posible usando `dropna()`. En el caso de una `Series` es posible eliminar directamente valores _nulos_, pero en el caso de `DataFrames` esto no es posible, pero si es posible eliminar filas o columnas completas. Por defecto `dropna()` eliminará todas las filas que contengan al menos un valor _nulo_.

In [143]:
mbm.dropna().head(11)

         Taxon  Paciente  Tejido   Heces
0   Firmicutes         1   632.0   305.0
1   Firmicutes         2   136.0  4182.0
3   Firmicutes         4   408.0  3946.0
4   Firmicutes         5   831.0  8605.0
5   Firmicutes         6   693.0    50.0
6   Firmicutes         7   718.0   717.0
7   Firmicutes         8   173.0    33.0
9   Firmicutes        10   162.0  3196.0
11  Firmicutes        12  4255.0  4361.0
12  Firmicutes        13   107.0  1667.0
14  Firmicutes        15   281.0  2377.0

Es posible que estemos interesados en _rellenar_ los valores _nulos_ en vez de eliminarlos con algún número que tenga sentido.

In [144]:
mbm.fillna(42).head(11)

         Taxon  Paciente  Tejido   Heces
0   Firmicutes         1   632.0   305.0
1   Firmicutes         2   136.0  4182.0
2   Firmicutes         3    42.0   703.0
3   Firmicutes         4   408.0  3946.0
4   Firmicutes         5   831.0  8605.0
5   Firmicutes         6   693.0    50.0
6   Firmicutes         7   718.0   717.0
7   Firmicutes         8   173.0    33.0
8   Firmicutes         9   228.0    42.0
9   Firmicutes        10   162.0  3196.0
10  Firmicutes        11   372.0    42.0

O simplementa completando con otros valores del propio `DataFrame`.

In [145]:
mbm.fillna(method='ffill').head(11)

         Taxon  Paciente  Tejido   Heces
0   Firmicutes         1   632.0   305.0
1   Firmicutes         2   136.0  4182.0
2   Firmicutes         3   136.0   703.0
3   Firmicutes         4   408.0  3946.0
4   Firmicutes         5   831.0  8605.0
5   Firmicutes         6   693.0    50.0
6   Firmicutes         7   718.0   717.0
7   Firmicutes         8   173.0    33.0
8   Firmicutes         9   228.0    33.0
9   Firmicutes        10   162.0  3196.0
10  Firmicutes        11   372.0  3196.0

## Indexado y selección en Series

El idexado y selección en Pandas es muy parecido al de NumPy.

Como ya vimos las series se pueden pensar como diccionarios o como arreglos unidimensionales. Los siguientes ejemplos muestra que ambas ideas son útiles.

In [146]:
datos = pd.Series([0, .25, .5, .75], index=['a', 'b', 'c', 'd'])

In [147]:
datos['b']

0.25

In [148]:
'e' in datos

False

In [149]:
datos.keys()

Index(['a', 'b', 'c', 'd'], dtype='object')

In [150]:
[_ for _ in datos.items()]

[('a', 0.0), ('b', 0.25), ('c', 0.5), ('d', 0.75)]

In [151]:
datos['e'] = 1.
datos

a    0.00
b    0.25
c    0.50
d    0.75
e    1.00
dtype: float64

Al indexar con un índice implícito el último índice NO se incluye. Esto es lo que esperamos de listas, tuplas, arreglos etc.

In [152]:
datos[1:3]

b    0.25
c    0.50
dtype: float64

Por lo que puede resultar confuso que al indexar con un índice explícito el último índice se incluye!

In [153]:
datos['b':'d']

b    0.25
c    0.50
d    0.75
dtype: float64

In [154]:
datos[datos > .5]

d    0.75
e    1.00
dtype: float64

In [155]:
datos[['e', 'a']]

e    1.0
a    0.0
dtype: float64

### Indexadores: loc e iloc

La presencia de índices implícitos y explícitos puede ser una fuente de gran confusión al usar Pandas. Veamos, que sucede cuando tenemosuna serie con índices explícitos que son enteros.

In [156]:
datos = pd.Series(['a', 'b', 'c'], index=[1, 3, 5])

Pandas usará el índice explítico al indexar

In [157]:
datos[1]

'a'

Pero el implícito al tomar rebanadas!

In [158]:
datos[1:3]

3    b
5    c
dtype: object

A fin de evitar confusiones Pandas provee de algunos métodos especiales para indexar. El primero de ellos es `loc` que permite hacer las operaciones de indexado/rebanado usando SIEMPRE el índice explícito.

In [159]:
datos.loc[1]

'a'

In [160]:
datos.loc[1:3]

1    a
3    b
dtype: object

la contraparte de `loc` es `iloc` quien siemrpe usa el índice  **i**mplícito.

In [161]:
datos.iloc[1]

'b'

In [162]:
datos.iloc[1:3]

3    b
5    c
dtype: object

Siguiendo el zen de Python que nos dice que “explícito es mejor que implícito". La recomendación general es usar `loc` e `iloc`. Ya que hace explícita la intención del código lo que ayuda a una más facil lectura y a reducir la posibilidad de errores.

## Indexado y selección en DataFrames

In [163]:
pob = {'BSAS':15594428,
       'Córdoba':3304825,
       'Santa Fe':3300736,
       'CABA':2891082,
       'Mendoza':1741610}

sup = {'BSAS':307571,
       'Córdoba':165321,
       'Santa Fe':133007,
       'CABA':202,
       'Mendoza':148827}

datos = pd.DataFrame({'sup':sup, 'pob':pob})
datos

               pob     sup
BSAS      15594428  307571
CABA       2891082     202
Córdoba    3304825  165321
Mendoza    1741610  148827
Santa Fe   3300736  133007

Como ya vimos es posible acceder a cada serie que forma un DataFrame usando una sintáxis simialr a la de los diccionarios

In [164]:
datos['sup']

BSAS        307571
CABA           202
Córdoba     165321
Mendoza     148827
Santa Fe    133007
Name: sup, dtype: int64

O usando una sintáxis de atributo

In [165]:
datos.sup

BSAS        307571
CABA           202
Córdoba     165321
Mendoza     148827
Santa Fe    133007
Name: sup, dtype: int64

La sintátix de atributo es solo _azucar sintáctico_ y podemos comprobar que devuelve exactamente el mismo objeto.

In [166]:
datos.sup is datos['sup']

True

Esta sintáxis no funciona para todos los casos, Algunos casos donde fallará es si la columna continene espacios o si el nombre de la columna entra en conflicto con algún método existente para DataFrames, por ejemplo no sería raro que llamaramos a una columna con alguno de estos nombres `all`, `cov`, `index`, `mean`.

Como ya vimos agregar una nueva columna a un DataFrame es similar a agregar un nuevo elemento a un diccionario.

In [167]:
datos['dens'] = datos['pob'] / datos['sup']
datos

               pob     sup          dens
BSAS      15594428  307571     50.701880
CABA       2891082     202  14312.287129
Córdoba    3304825  165321     19.990352
Mendoza    1741610  148827     11.702245
Santa Fe   3300736  133007     24.816258

Como ya vimos en la introducción a DataFrames, es posible ver estas estructuras de datos como arreglos de NumPy. Esto se hace evidente al quedarnos solo con los _valores_ de un DataFrame.

In [168]:
datos.values

array([[  1.55944280e+07,   3.07571000e+05,   5.07018802e+01],
       [  2.89108200e+06,   2.02000000e+02,   1.43122871e+04],
       [  3.30482500e+06,   1.65321000e+05,   1.99903521e+01],
       [  1.74161000e+06,   1.48827000e+05,   1.17022449e+01],
       [  3.30073600e+06,   1.33007000e+05,   2.48162578e+01]])

Pero las similitudes son más amplias, por ejemplo podemos transponer un DataFrame al igual que un _arreglo_.

In [169]:
datos.T

              BSAS          CABA       Córdoba       Mendoza      Santa Fe
pob   1.559443e+07  2.891082e+06  3.304825e+06  1.741610e+06  3.300736e+06
sup   3.075710e+05  2.020000e+02  1.653210e+05  1.488270e+05  1.330070e+05
dens  5.070188e+01  1.431229e+04  1.999035e+01  1.170224e+01  2.481626e+01

Las similitudes de un DataFrame entre un diccionario y un arreglo entran en conflicto al querer indexarlo. Veamos, no sorprende que al pasar un solo índice

In [170]:
datos.values[0]

array([  1.55944280e+07,   3.07571000e+05,   5.07018802e+01])

obtengamos la primer fila, esto es precisamente lo que se espera de un arreglo de NumPy. Pero hay que notar que al pasar un solo _índice_ a un DataFrame, lo que se obtiene es una columna y no una fila!

In [171]:
datos['sup']

BSAS        307571
CABA           202
Córdoba     165321
Mendoza     148827
Santa Fe    133007
Name: sup, dtype: int64

Por ello también existen indexadores especiales para DataFrames, `loc` e `iloc` ya los  conocemos de la sección anterior. Recordemos `loc` usa el índice explícito.

In [172]:
datos.loc[:'Córdoba']

              pob     sup          dens
BSAS     15594428  307571     50.701880
CABA      2891082     202  14312.287129
Córdoba   3304825  165321     19.990352

Y ya que tenemos dos dimensiones para indexar podemos hacer selecciones como la siguiente:

In [173]:
datos.loc[:'Córdoba', 'sup':]

            sup          dens
BSAS     307571     50.701880
CABA        202  14312.287129
Córdoba  165321     19.990352

Al usar `iloc` especificamos el índice implicito. Por lo que para obtener el mismo resultado que en la celda anterior hacemos:

In [174]:
datos.iloc[:3, 1:]

            sup          dens
BSAS     307571     50.701880
CABA        202  14312.287129
Córdoba  165321     19.990352

Como empezamos a ver en el capítulo sobre NumPy, es posible seleccionar subconjuntos de datos de forma muy versatil, estas capacidades se extienden a los DataFrames.

In [175]:
datos.loc[datos.dens > 50, ['sup', 'dens']]

         sup          dens
BSAS  307571     50.701880
CABA     202  14312.287129

## Funciones Universales

Una de las características más valiosas de NumPy es la posiblidad de vectorizar código, evitando escribir _loops_, al realizar operaciones como sumas, multiplicaciones, logaritmos, etc. Pandas hereda de NumPy esta capacidad y la adapta de dos formas:

1. Para operaciones unarias al aplicar funciones univerales se preserva el índice, es decir solo se aplican las operaciones a los valores y no a los _rótulos_.
2. Para operaciones binarias, las mismas se realizan sobre los índices alineados

Esto facilita el realizar operaciones que implican combinar datos de distintas fuentes, algo que puede no ser tan simple al usar NumPy.

Veamos un ejemplo al operar con dos series a fin de calcular la densidad de población

In [176]:
pob = pd.Series({'BSAS':15594428,'Córdoba':3304825, 'Santa Fe':3300736, 'CABA':2891082, 'San Luis':476351}, name='pob')
sup = pd.Series({'BSAS':307571,'Córdoba':165321, 'Santa Fe':133007, 'CABA':202, 'Mendoza':148827}, name='sub')

pob / sup

BSAS           50.701880
CABA        14312.287129
Córdoba        19.990352
Mendoza              NaN
San Luis             NaN
Santa Fe       24.816258
dtype: float64

El resultado es una `Series` donde el índice corresponde a la _unión_ de los índices de `sup` y `pop`. Como para `san Luis` tenemos la población pero no la superficie y para `Mendoza` tenemos la  superficie pero no la población. El resultado es que en la nueva `Series` obtenemos `NaN` para estas dos provincias. 

Es posible cambiar este comportamiento al usar el método `.div()` (en vez de usar el operador `/`). Ahora podemos indicar que cambie `NaN` por otro valor.

In [177]:
pob.div(sup, fill_value=0)

BSAS        5.070188e+01
CABA        1.431229e+04
Córdoba     1.999035e+01
Mendoza     0.000000e+00
San Luis             inf
Santa Fe    2.481626e+01
dtype: float64

El cambio se realiza antes de realizar la operación, por eso obtenemos `0` para `Mendoza` e `inf` para San Luis. Una variante sería hacer la operación y luego cambiar los `NaN` por cualquier otro valor (incluso uno con muy poco sentido).

In [178]:
(pob / sup).fillna('ϵ')

BSAS        50.7019
CABA        14312.3
Córdoba     19.9904
Mendoza           ϵ
San Luis          ϵ
Santa Fe    24.8163
dtype: object

En los DataFrames el _alineamiento_ tiene en cuenta  tanto las columnas comos los índices.

In [179]:
A = pd.DataFrame(np.arange(1, 5).reshape(2, 2), columns=['A', 'B'])
A

   A  B
0  1  2
1  3  4

In [180]:
B = pd.DataFrame(np.arange(10, 19).reshape(3, 3), columns=['B', 'A', 'C'])
B

    B   A   C
0  10  11  12
1  13  14  15
2  16  17  18

In [181]:
A + B

      A     B   C
0  12.0  12.0 NaN
1  17.0  17.0 NaN
2   NaN   NaN NaN

Como habrás podido ver los índices quedan alineados correctamente independientemente de su orden en los objetos originales.

Como en el caso de `Series`, podemos utilizar las el método aritmético del objeto y pasar cualquier valor de relleno que deseemos, por ejemplo la media de todos los valores en A.

In [182]:
fill = A.values.mean()
A.add(B, fill_value=fill)

      A     B     C
0  12.0  12.0  14.5
1  17.0  17.0  17.5
2  19.5  18.5  20.5

Por supuesto también podemos combinar operaciones entre `Series` y `DataFrames` y Pandas se ocupará de mantener los "rótulos" alineados.

In [183]:
B - B.iloc[0]

   B  A  C
0  0  0  0
1  3  3  3
2  6  6  6

La operación anterior se realizó a lo largo de las filas (como se esperaría en NumPy), si quisieramos hacerlo a lo largo de las columnas:

In [184]:
B.subtract(B['B'], axis=0)

   B  A  C
0  0  1  2
1  0  1  2
2  0  1  2

## Indexado jerárquico

Hasta ahora hemos visto como trabajar con datos uni y bi-dimensionales. El indexado jerárquico (o multi-indexado) permite usar más de un índice en un DataFrame, de esta forma podemos trabajar en más de dos dimensiones pero usando un DataFrame.

Por ejemplo si quiesieramos usar como índice la ciudad y el año podríamos lograrlo con un tupla

In [185]:
index = [('Córdoba', 2010), ('Córdoba', 2001),
         ('CABA', 2010), ('CABA', 2001),
         ('Mendoza', 2010), ('Mendoza', 2001)]
pob = (3304825, 2891082, 1741610,
       3021957, 2776138, 1579651)

df = pd.Series(pob, index=index)
df

(Córdoba, 2010)    3304825
(Córdoba, 2001)    2891082
(CABA, 2010)       1741610
(CABA, 2001)       3021957
(Mendoza, 2010)    2776138
(Mendoza, 2001)    1579651
dtype: int64

Pandas nos ofrece una alternativa

In [188]:
nuevo_indice = pd.MultiIndex.from_tuples(index)
df = df.reindex(nuevo_indice)
df

Córdoba  2010    3304825
         2001    2891082
CABA     2010    1741610
         2001    3021957
Mendoza  2010    2776138
         2001    1579651
dtype: int64

Falta:

Indexado jerárquico. Combinación de DataFrames: concat, append, merge, join. Datos agregados y agrupados . Operaciones vectorizadas con string. Series temporales.